<?php
session_start();
require_once 'config.php';

$users = [
    ['2063', '千葉真敏'],
    ['8942', '石川絵莉依'],
    ['9099', '伊藤恵美子'],
    ['2033', '小原秋彦'],
    ['9036', '滝沢節子'],
    ['9068', '菅原里香'],
    ['2166', '佐藤和彦'],
    ['2054', '千葉一'],
    ['3127', '石川和恵'],
    ['8930', '小山大輔'],
    ['8933', '千田裕子'],
    ['9242', '千葉　司'],
    ['9228', '豊田 純士'],
    ['8968', '菅原静恵'],
    ['8989', '石川美紀子'],
    ['8991', '千田京汰'],
    ['8995', '上飯坂司'],
    ['8998', '小原幸子'],
    ['6831', '津田里恵'],
    ['6832', '和賀正勝'],
    ['6833', '佐藤 太'],
    ['6839', '千田 まどか'],
    ['6864', '佐藤 啓子'],
    ['6842', '和田 さゆり'],
    ['6843', '天野 光二'],
    ['6844', '後藤 亜紀子'],
    ['6848', '小幡 七海'],
    ['6856', '菅原 絢也'],
];

$password = "123456";
$password_hash = password_hash($password, PASSWORD_DEFAULT);

foreach ($users as $u) {

    $login_id = $u[0];
    $name     = $u[1];

    $sql = "
        INSERT INTO users (login_id, name, password_hash)
        VALUES (?, ?, ?)
    ";

    $stmt = $conn->prepare($sql);
    $stmt->bind_param("sss", $login_id, $name, $password_hash);
    $stmt->execute();
}

echo "登録完了";
?>